#include<stdio.h> 
#include<string.h>

//void reverse(char* left, char* right)
//{
//	while (left < right)
//	{
//		char a = *left;
//		*left = *right;
//		*right = a;
//		left++;
//		right--;
//	}
//}
//
//int main()
//{
//	char a[101] = { 0 };
//	//输入
//	gets(a);
//
//	//逆置
//	int len = strlen(a);
//	reverse(a, a + len - 1);
//
//	//逆序
//	char* start = a;
//	while (*start)
//	{
//		char* end = start;
//		while (*end != ' ' && *end != '\0')
//			end++;
//		reverse(start, end - 1);
//		if (*end != '\0')
//			end++;
//		start = end;
//	}
//
//	//输出
//	printf("%s", a);
//	return 0;
//}

//数值有不同的表现形式
//2进制、8进制、10进制、16进制
//例 - 21：
//2进制：0b10101  8进制：025  10进制：21  16进制：0x15

/*
同样，数值（整数）的2进制表示形式也有三种：原码（直接根据正负形式的2进制形式），反码（原码的符号位不变（若此数值为signed型），其他位取反），补码（反码+1）
正的整数，三码相同/负的整数，三码需要计算
对于整形：数据存放内存中的其实是补码
*/

//例：
int main()
{
	int a = 20;
	//00000000000000000000000000010100
	//0x00000014
	//00000000000000000000000000010100
	//00000000000000000000000000010100

	int b = -10;
	//因为是负数，即高位是1（2进制表示时第一位为符号位）
	//10000000000000000000000000001010
	//0x8000000a
	//11111111111111111111111111110101
	//0xfffffff5
	//11111111111111111111111111110110
	//0xfffffff6
	return 0;
}